1) /app/src/Driver/SynchronousDriver.php:69    [M] Plus

--- Original
+++ New
@@ @@
     }
     public function push(MessageInterface $message) : string
     {
-        $key = count($this->messages) + $this->current;
+        $key = count($this->messages) - $this->current;
         $this->messages[] = $message;
         return (string) $key;
     }

2) /app/src/Enum/JobStatus.php:17    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     public const RESERVED = 2;
     public const DONE = 3;
     protected int $status;
-    protected function __construct(int $status)
+    private function __construct(int $status)
     {
         if (!in_array($status, $this->available(), true)) {
             throw new InvalidStatusException($status);

3) /app/src/Enum/JobStatus.php:26    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         }
         $this->status = $status;
     }
-    protected function available() : array
+    private function available() : array
     {
         return [self::WAITING, self::RESERVED, self::DONE];
     }

4) /app/src/Exception/PayloadNotSupportedException.php:25    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     private DriverInterface $driver;
     private PayloadInterface $payload;
-    public function __construct(DriverInterface $driver, PayloadInterface $payload, string $message = '', int $code = 0, Throwable $previous = null)
+    public function __construct(DriverInterface $driver, PayloadInterface $payload, string $message = '', int $code = -1, Throwable $previous = null)
     {
         if ($message === '') {
             $driverClass = get_class($driver);

5) /app/src/Exception/PayloadNotSupportedException.php:25    [M] OneZeroInteger

--- Original
+++ New
@@ @@
 {
     private DriverInterface $driver;
     private PayloadInterface $payload;
-    public function __construct(DriverInterface $driver, PayloadInterface $payload, string $message = '', int $code = 0, Throwable $previous = null)
+    public function __construct(DriverInterface $driver, PayloadInterface $payload, string $message = '', int $code = 1, Throwable $previous = null)
     {
         if ($message === '') {
             $driverClass = get_class($driver);

6) /app/src/Queue.php:56    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function jobRetry(JobFailure $event) : void
     {
-        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
+        if (($event->getQueue() === $this || !$event->getException() instanceof PayloadNotSupportedException) && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);

7) /app/src/Queue.php:56    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function jobRetry(JobFailure $event) : void
     {
-        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
+        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException || ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);

8) /app/src/Queue.php:58    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     public function jobRetry(JobFailure $event) : void
     {
-        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
+        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) >= 0) {
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);

9) /app/src/Queue.php:58    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     }
     public function jobRetry(JobFailure $event) : void
     {
-        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
+        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 1) > 0) {
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);

10) /app/src/Queue.php:58    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function jobRetry(JobFailure $event) : void
     {
-        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
+        if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? -1) > 0) {
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);

11) /app/src/Queue.php:61    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         if ($event->getQueue() === $this && !$event->getException() instanceof PayloadNotSupportedException && ($event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] ?? 0) > 0) {
             $event->preventThrowing();
-            $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
+            $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 2;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);
             $this->logger->debug('Retrying payload "{payload}".', ['payload' => $event->getMessage()->getPayloadName()]);
             $this->push($payload);

12) /app/src/Queue.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);
-            $this->logger->debug('Retrying payload "{payload}".', ['payload' => $event->getMessage()->getPayloadName()]);
+            
             $this->push($payload);
         }
     }

13) /app/src/Queue.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);
-            $this->logger->debug('Retrying payload "{payload}".', ['payload' => $event->getMessage()->getPayloadName()]);
+            $this->logger->debug('Retrying payload "{payload}".', []);
             $this->push($payload);
         }
     }

14) /app/src/Queue.php:65    [M] ArrayItem

--- Original
+++ New
@@ @@
             $event->preventThrowing();
             $attemptsLeft = $event->getMessage()->getPayloadMeta()[PayloadInterface::META_KEY_ATTEMPTS] - 1;
             $payload = $this->messageConvert($event->getMessage(), [PayloadInterface::META_KEY_ATTEMPTS => $attemptsLeft]);
-            $this->logger->debug('Retrying payload "{payload}".', ['payload' => $event->getMessage()->getPayloadName()]);
+            $this->logger->debug('Retrying payload "{payload}".', ['payload' > $event->getMessage()->getPayloadName()]);
             $this->push($payload);
         }
     }

15) /app/src/Queue.php:81    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function push(PayloadInterface $payload) : ?string
     {
-        $this->logger->debug('Preparing to push payload "{payload}".', ['payload' => $payload->getName()]);
+        
         $message = $this->payloadConvert($payload);
         $this->eventDispatcher->dispatch(new BeforePush($this, $message));
         if ($this->driver->canPush($message)) {

16) /app/src/Queue.php:81    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function push(PayloadInterface $payload) : ?string
     {
-        $this->logger->debug('Preparing to push payload "{payload}".', ['payload' => $payload->getName()]);
+        $this->logger->debug('Preparing to push payload "{payload}".', []);
         $message = $this->payloadConvert($payload);
         $this->eventDispatcher->dispatch(new BeforePush($this, $message));
         if ($this->driver->canPush($message)) {

17) /app/src/Queue.php:81    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function push(PayloadInterface $payload) : ?string
     {
-        $this->logger->debug('Preparing to push payload "{payload}".', ['payload' => $payload->getName()]);
+        $this->logger->debug('Preparing to push payload "{payload}".', ['payload' > $payload->getName()]);
         $message = $this->payloadConvert($payload);
         $this->eventDispatcher->dispatch(new BeforePush($this, $message));
         if ($this->driver->canPush($message)) {

18) /app/src/Queue.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->eventDispatcher->dispatch(new BeforePush($this, $message));
         if ($this->driver->canPush($message)) {
             $message->setId($this->driver->push($message));
-            $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
+            
         } else {
             $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
             throw new PayloadNotSupportedException($this->driver, $payload);

19) /app/src/Queue.php:89    [M] ArrayItem

--- Original
+++ New
@@ @@
         $this->eventDispatcher->dispatch(new BeforePush($this, $message));
         if ($this->driver->canPush($message)) {
             $message->setId($this->driver->push($message));
-            $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
+            $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' > $message->getPayloadName()]);
         } else {
             $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
             throw new PayloadNotSupportedException($this->driver, $payload);

20) /app/src/Queue.php:89    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $this->eventDispatcher->dispatch(new BeforePush($this, $message));
         if ($this->driver->canPush($message)) {
             $message->setId($this->driver->push($message));
-            $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
+            $this->logger->debug('Successfully pushed message "{name}" to the queue.', []);
         } else {
             $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
             throw new PayloadNotSupportedException($this->driver, $payload);

21) /app/src/Queue.php:92    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $message->setId($this->driver->push($message));
             $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
         } else {
-            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
+            
             throw new PayloadNotSupportedException($this->driver, $payload);
         }
         $this->eventDispatcher->dispatch(new AfterPush($this, $message));

22) /app/src/Queue.php:94    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $message->setId($this->driver->push($message));
             $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
         } else {
-            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
+            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['driver' => get_class($this->driver)]);
             throw new PayloadNotSupportedException($this->driver, $payload);
         }
         $this->eventDispatcher->dispatch(new AfterPush($this, $message));

23) /app/src/Queue.php:95    [M] ArrayItem

--- Original
+++ New
@@ @@
             $message->setId($this->driver->push($message));
             $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
         } else {
-            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
+            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' > $payload->getName(), 'driver' => get_class($this->driver)]);
             throw new PayloadNotSupportedException($this->driver, $payload);
         }
         $this->eventDispatcher->dispatch(new AfterPush($this, $message));

24) /app/src/Queue.php:96    [M] ArrayItem

--- Original
+++ New
@@ @@
             $message->setId($this->driver->push($message));
             $this->logger->debug('Successfully pushed message "{name}" to the queue.', ['name' => $message->getPayloadName()]);
         } else {
-            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' => get_class($this->driver)]);
+            $this->logger->error('Payload "{payload}" is not supported by driver "{driver}."', ['payload' => $payload->getName(), 'driver' > get_class($this->driver)]);
             throw new PayloadNotSupportedException($this->driver, $payload);
         }
         $this->eventDispatcher->dispatch(new AfterPush($this, $message));

25) /app/src/Queue.php:113    [M] DecrementInteger

--- Original
+++ New
@@ @@
      *
      * @param int $max
      */
-    public function run(int $max = 0) : void
+    public function run(int $max = -1) : void
     {
         $this->logger->debug('Start processing queue messages.');
         $count = 0;

26) /app/src/Queue.php:115    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function run(int $max = 0) : void
     {
-        $this->logger->debug('Start processing queue messages.');
+        
         $count = 0;
         while (($max <= 0 || $max > $count) && $this->loop->canContinue() && ($message = $this->driver->nextMessage())) {
             $this->handle($message);

27) /app/src/Queue.php:127    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->handle($message);
             $count++;
         }
-        $this->logger->debug('Finish processing queue messages. There were {count} messages to work with.', ['count' => $count]);
+        
     }
     /**
      * Listen to the queue and execute jobs as they come

28) /app/src/Queue.php:129    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->handle($message);
             $count++;
         }
-        $this->logger->debug('Finish processing queue messages. There were {count} messages to work with.', ['count' => $count]);
+        $this->logger->debug('Finish processing queue messages. There were {count} messages to work with.', []);
     }
     /**
      * Listen to the queue and execute jobs as they come

29) /app/src/Queue.php:138    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function listen() : void
     {
-        $this->logger->debug('Start listening to the queue.');
+        
         $this->driver->subscribe(fn(MessageInterface $message) => $this->handle($message));
         $this->logger->debug('Finish listening to the queue.');
     }

30) /app/src/Queue.php:140    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->logger->debug('Start listening to the queue.');
         $this->driver->subscribe(fn(MessageInterface $message) => $this->handle($message));
-        $this->logger->debug('Finish listening to the queue.');
+        
     }
     /**
      * @param string $id A message id

31) /app/src/Queue.php:155    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return $this->driver->status($id);
     }
-    protected function handle(MessageInterface $message) : void
+    private function handle(MessageInterface $message) : void
     {
         $this->worker->process($message, $this);
     }

32) /app/src/Queue.php:160    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         $this->worker->process($message, $this);
     }
-    protected function payloadConvert(PayloadInterface $payload) : MessageInterface
+    private function payloadConvert(PayloadInterface $payload) : MessageInterface
     {
         $meta = $payload->getMeta();
         if ($payload instanceof DelayablePayloadInterface) {

33) /app/src/Queue.php:179    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         }
         return new Message($payload->getName(), $payload->getData(), $meta);
     }
-    protected function messageConvert(MessageInterface $message, array $metaOverwrite) : PayloadInterface
+    private function messageConvert(MessageInterface $message, array $metaOverwrite) : PayloadInterface
     {
         $meta = array_merge($message->getPayloadMeta(), $metaOverwrite);
         return new BasicPayload($message->getPayloadName(), $message->getPayloadData(), $meta);
     }
 }

34) /app/src/Queue.php:181    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     }
     protected function messageConvert(MessageInterface $message, array $metaOverwrite) : PayloadInterface
     {
-        $meta = array_merge($message->getPayloadMeta(), $metaOverwrite);
+        $meta = $metaOverwrite;
         return new BasicPayload($message->getPayloadName(), $message->getPayloadData(), $meta);
     }
 }

35) /app/src/Worker/Worker.php:50    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function process(MessageInterface $message, Queue $queue) : void
     {
-        $this->logger->debug('Start working with message #{message}.', ['message' => $message->getId()]);
+        $this->logger->debug('Start working with message #{message}.', ['message' > $message->getId()]);
         $name = $message->getPayloadName();
         $handler = $this->getHandler($name);
         if ($handler === null) {

36) /app/src/Worker/Worker.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function process(MessageInterface $message, Queue $queue) : void
     {
-        $this->logger->debug('Start working with message #{message}.', ['message' => $message->getId()]);
+        $this->logger->debug('Start working with message #{message}.', []);
         $name = $message->getPayloadName();
         $handler = $this->getHandler($name);
         if ($handler === null) {

37) /app/src/Worker/Worker.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function process(MessageInterface $message, Queue $queue) : void
     {
-        $this->logger->debug('Start working with message #{message}.', ['message' => $message->getId()]);
+        
         $name = $message->getPayloadName();
         $handler = $this->getHandler($name);
         if ($handler === null) {

38) /app/src/Worker/Worker.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $event = new AfterExecution($queue, $message);
                 $this->dispatcher->dispatch($event);
             } else {
-                $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
+                
             }
         } catch (Throwable $exception) {
             $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);

39) /app/src/Worker/Worker.php:70    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $event = new AfterExecution($queue, $message);
                 $this->dispatcher->dispatch($event);
             } else {
-                $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
+                $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' > $message->getId()]);
             }
         } catch (Throwable $exception) {
             $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);

40) /app/src/Worker/Worker.php:70    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $event = new AfterExecution($queue, $message);
                 $this->dispatcher->dispatch($event);
             } else {
-                $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
+                $this->logger->notice('Execution of message #{message} is stopped by an event handler.', []);
             }
         } catch (Throwable $exception) {
             $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);

41) /app/src/Worker/Worker.php:74    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
             }
         } catch (Throwable $exception) {
-            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);
+            
             $event = new JobFailure($queue, $message, $exception);
             $this->dispatcher->dispatch($event);
             if ($event->shouldThrowException() === true) {

42) /app/src/Worker/Worker.php:76    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
             }
         } catch (Throwable $exception) {
-            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);
+            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['exception' => $exception->getMessage()]);
             $event = new JobFailure($queue, $message, $exception);
             $this->dispatcher->dispatch($event);
             if ($event->shouldThrowException() === true) {

43) /app/src/Worker/Worker.php:77    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
             }
         } catch (Throwable $exception) {
-            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);
+            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' > $message->getId(), 'exception' => $exception->getMessage()]);
             $event = new JobFailure($queue, $message, $exception);
             $this->dispatcher->dispatch($event);
             if ($event->shouldThrowException() === true) {

44) /app/src/Worker/Worker.php:78    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $this->logger->notice('Execution of message #{message} is stopped by an event handler.', ['message' => $message->getId()]);
             }
         } catch (Throwable $exception) {
-            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' => $exception->getMessage()]);
+            $this->logger->error("Processing of message #{message} is stopped because of an exception:\n{exception}.", ['message' => $message->getId(), 'exception' > $exception->getMessage()]);
             $event = new JobFailure($queue, $message, $exception);
             $this->dispatcher->dispatch($event);
             if ($event->shouldThrowException() === true) {

45) /app/src/Worker/Worker.php:121    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     private function isAlias($handler) : bool
     {
-        return is_array($handler) && array_keys($handler) === [0, 1] && is_string($handler[0]);
+        return is_array($handler) && array_keys($handler) === [0, 1] || is_string($handler[0]);
     }
 }

46) /app/src/Worker/Worker.php:121    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     private function isAlias($handler) : bool
     {
-        return is_array($handler) && array_keys($handler) === [0, 1] && is_string($handler[0]);
+        return (is_array($handler) || array_keys($handler) === [0, 1]) && is_string($handler[0]);
     }
 }

47) /app/src/Worker/Worker.php:123    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     private function isAlias($handler) : bool
     {
-        return is_array($handler) && array_keys($handler) === [0, 1] && is_string($handler[0]);
+        return is_array($handler) && array_keys($handler) === [0, 1] && is_string($handler[1]);
     }
 }


Timed Out mutants:
==================

Not Covered mutants:
====================

1) /app/src/Cli/SignalLoop.php:51    [M] Foreach_

--- Original
+++ New
@@ @@
     public function __construct()
     {
         if (extension_loaded('pcntl')) {
-            foreach ($this->exitSignals as $signal) {
+            foreach (array() as $signal) {
                 pcntl_signal($signal, fn() => $this->exit = true);
             }
             foreach ($this->suspendSignals as $signal) {

2) /app/src/Cli/SignalLoop.php:52    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         if (extension_loaded('pcntl')) {
             foreach ($this->exitSignals as $signal) {
-                pcntl_signal($signal, fn() => $this->exit = true);
+                pcntl_signal($signal, fn() => $this->exit = false);
             }
             foreach ($this->suspendSignals as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = true);

3) /app/src/Cli/SignalLoop.php:52    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         if (extension_loaded('pcntl')) {
             foreach ($this->exitSignals as $signal) {
-                pcntl_signal($signal, fn() => $this->exit = true);
+                
             }
             foreach ($this->suspendSignals as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = true);

4) /app/src/Cli/SignalLoop.php:54    [M] Foreach_

--- Original
+++ New
@@ @@
             foreach ($this->exitSignals as $signal) {
                 pcntl_signal($signal, fn() => $this->exit = true);
             }
-            foreach ($this->suspendSignals as $signal) {
+            foreach (array() as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = true);
             }
             foreach ($this->resumeSignals as $signal) {

5) /app/src/Cli/SignalLoop.php:55    [M] TrueValue

--- Original
+++ New
@@ @@
                 pcntl_signal($signal, fn() => $this->exit = true);
             }
             foreach ($this->suspendSignals as $signal) {
-                pcntl_signal($signal, fn() => $this->pause = true);
+                pcntl_signal($signal, fn() => $this->pause = false);
             }
             foreach ($this->resumeSignals as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = false);
