6) /app/src/Cli/SignalLoop.php:55    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 pcntl_signal($signal, fn() => $this->exit = true);
             }
             foreach ($this->suspendSignals as $signal) {
-                pcntl_signal($signal, fn() => $this->pause = true);
+                
             }
             foreach ($this->resumeSignals as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = false);

7) /app/src/Cli/SignalLoop.php:57    [M] Foreach_

--- Original
+++ New
@@ @@
             foreach ($this->suspendSignals as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = true);
             }
-            foreach ($this->resumeSignals as $signal) {
+            foreach (array() as $signal) {
                 pcntl_signal($signal, fn() => $this->pause = false);
             }
         }

8) /app/src/Cli/SignalLoop.php:58    [M] FalseValue

--- Original
+++ New
@@ @@
                 pcntl_signal($signal, fn() => $this->pause = true);
             }
             foreach ($this->resumeSignals as $signal) {
-                pcntl_signal($signal, fn() => $this->pause = false);
+                pcntl_signal($signal, fn() => $this->pause = true);
             }
         }
     }

9) /app/src/Cli/SignalLoop.php:58    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 pcntl_signal($signal, fn() => $this->pause = true);
             }
             foreach ($this->resumeSignals as $signal) {
-                pcntl_signal($signal, fn() => $this->pause = false);
+                
             }
         }
     }

10) /app/src/Cli/SignalLoop.php:71    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     public function canContinue() : bool
     {
         if (extension_loaded('pcntl')) {
-            pcntl_signal_dispatch();
+            
             // Wait for resume signal until loop is suspended
             while ($this->pause && !$this->exit) {
                 usleep(10000);

11) /app/src/Cli/SignalLoop.php:73    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (extension_loaded('pcntl')) {
             pcntl_signal_dispatch();
             // Wait for resume signal until loop is suspended
-            while ($this->pause && !$this->exit) {
+            while ($this->pause && $this->exit) {
                 usleep(10000);
                 pcntl_signal_dispatch();
             }

12) /app/src/Cli/SignalLoop.php:73    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (extension_loaded('pcntl')) {
             pcntl_signal_dispatch();
             // Wait for resume signal until loop is suspended
-            while ($this->pause && !$this->exit) {
+            while ($this->pause || !$this->exit) {
                 usleep(10000);
                 pcntl_signal_dispatch();
             }

13) /app/src/Cli/SignalLoop.php:74    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             pcntl_signal_dispatch();
             // Wait for resume signal until loop is suspended
             while ($this->pause && !$this->exit) {
-                usleep(10000);
+                
                 pcntl_signal_dispatch();
             }
         }

14) /app/src/Cli/SignalLoop.php:74    [M] IncrementInteger

--- Original
+++ New
@@ @@
             pcntl_signal_dispatch();
             // Wait for resume signal until loop is suspended
             while ($this->pause && !$this->exit) {
-                usleep(10000);
+                usleep(10001);
                 pcntl_signal_dispatch();
             }
         }

15) /app/src/Cli/SignalLoop.php:74    [M] DecrementInteger

--- Original
+++ New
@@ @@
             pcntl_signal_dispatch();
             // Wait for resume signal until loop is suspended
             while ($this->pause && !$this->exit) {
-                usleep(10000);
+                usleep(9999);
                 pcntl_signal_dispatch();
             }
         }

16) /app/src/Cli/SignalLoop.php:75    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             // Wait for resume signal until loop is suspended
             while ($this->pause && !$this->exit) {
                 usleep(10000);
-                pcntl_signal_dispatch();
+                
             }
         }
         return !$this->exit;

17) /app/src/Cli/SignalLoop.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return !$this->exit;
     }
-    public function setResumeSignals(array $resumeSignals) : void
+    protected function setResumeSignals(array $resumeSignals) : void
     {
         $this->resumeSignals = $resumeSignals;
     }

18) /app/src/Cli/SignalLoop.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->resumeSignals = $resumeSignals;
     }
-    public function setSuspendSignals(array $suspendSignals) : void
+    protected function setSuspendSignals(array $suspendSignals) : void
     {
         $this->suspendSignals = $suspendSignals;
     }
 }

20) /app/src/Command/ListenCommand.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::__construct($name);
         $this->queue = $queue;
-        $this->setDescription('Listens the queue and executes messages as they come. Needs to be stopped manually.');
+        
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {

21) /app/src/Command/ListenCommand.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
-        $this->queue->listen();
+        
         return 0;
     }
 }

22) /app/src/Command/ListenCommand.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
         $this->queue->listen();
-        return 0;
+        return -1;
     }
 }

23) /app/src/Command/ListenCommand.php:31    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
         $this->queue->listen();
-        return 0;
+        return 1;
     }
 }

25) /app/src/Command/RunCommand.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::__construct($name);
         $this->queue = $queue;
-        $this->setDescription('Runs all the existing messages in the queue. Exits once messages are over.');
+        
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {

26) /app/src/Command/RunCommand.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
-        $this->queue->run();
+        
         return 0;
     }
 }

27) /app/src/Command/RunCommand.php:29    [M] DecrementInteger

--- Original
+++ New
@@ @@
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
         $this->queue->run();
-        return 0;
+        return -1;
     }
 }

28) /app/src/Command/RunCommand.php:29    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
         $this->queue->run();
-        return 0;
+        return 1;
     }
 }

29) /app/src/Driver/SynchronousDriver.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function __destruct()
     {
-        $this->run([$this->worker, 'process']);
+        $this->run(['process']);
     }
     public function nextMessage() : ?MessageInterface
     {

30) /app/src/Driver/SynchronousDriver.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __destruct()
     {
-        $this->run([$this->worker, 'process']);
+        
     }
     public function nextMessage() : ?MessageInterface
     {

31) /app/src/Driver/SynchronousDriver.php:53    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $id = (int) $id;
         if ($id < 0) {
-            throw new InvalidArgumentException('This driver ids starts with 0');
+            new InvalidArgumentException('This driver ids starts with 0');
         }
         if ($id < $this->current) {
             return JobStatus::done();

32) /app/src/Driver/SynchronousDriver.php:64    [M] Throw_

--- Original
+++ New
@@ @@
         if (isset($this->messages[$id])) {
             return JobStatus::waiting();
         }
-        throw new InvalidArgumentException('There is no message with the given id.');
+        new InvalidArgumentException('There is no message with the given id.');
     }
     public function push(MessageInterface $message) : string
     {

33) /app/src/Enum/JobStatus.php:20    [M] Throw_

--- Original
+++ New
@@ @@
     protected function __construct(int $status)
     {
         if (!in_array($status, $this->available(), true)) {
-            throw new InvalidStatusException($status);
+            new InvalidStatusException($status);
         }
         $this->status = $status;
     }

34) /app/src/Event/AfterExecution.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->queue = $queue;
         $this->message = $message;
     }
-    public function getMessage() : MessageInterface
+    protected function getMessage() : MessageInterface
     {
         return $this->message;
     }

35) /app/src/Event/AfterExecution.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->message;
     }
-    public function getQueue() : Queue
+    protected function getQueue() : Queue
     {
         return $this->queue;
     }
 }

42) /app/src/Event/BeforePush.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->queue;
     }
-    public function isExecutionStopped() : bool
+    protected function isExecutionStopped() : bool
     {
         return $this->stop;
     }

43) /app/src/Event/BeforePush.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->stop;
     }
-    public function stopExecution() : void
+    protected function stopExecution() : void
     {
         $this->stop = true;
     }
 }

44) /app/src/Event/BeforePush.php:39    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     public function stopExecution() : void
     {
-        $this->stop = true;
+        $this->stop = false;
     }
 }

45) /app/src/Event/JobFailure.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->throw = false;
     }
-    public function stopPropagation() : void
+    protected function stopPropagation() : void
     {
         $this->stop = true;
     }

47) /app/src/Exception/InvalidStatusException.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
 class InvalidStatusException extends InvalidArgumentException implements FriendlyExceptionInterface
 {
     private int $status;
-    public function __construct(int $status, string $message = '', $code = 0, Throwable $previous = null)
+    public function __construct(int $status, string $message = '', $code = -1, Throwable $previous = null)
     {
         if ($message === '') {
             $message = "Invalid status provided: {$status}";

48) /app/src/Exception/InvalidStatusException.php:15    [M] OneZeroInteger

--- Original
+++ New
@@ @@
 class InvalidStatusException extends InvalidArgumentException implements FriendlyExceptionInterface
 {
     private int $status;
-    public function __construct(int $status, string $message = '', $code = 0, Throwable $previous = null)
+    public function __construct(int $status, string $message = '', $code = 1, Throwable $previous = null)
     {
         if ($message === '') {
             $message = "Invalid status provided: {$status}";

49) /app/src/Exception/InvalidStatusException.php:17    [M] Identical

--- Original
+++ New
@@ @@
     private int $status;
     public function __construct(int $status, string $message = '', $code = 0, Throwable $previous = null)
     {
-        if ($message === '') {
+        if ($message !== '') {
             $message = "Invalid status provided: {$status}";
         }
         parent::__construct($message, $code, $previous);

50) /app/src/Exception/InvalidStatusException.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($message === '') {
             $message = "Invalid status provided: {$status}";
         }
-        parent::__construct($message, $code, $previous);
+        
         $this->status = $status;
     }
     public function getName() : string

51) /app/src/Exception/InvalidStatusException.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return int
      */
-    public function getStatus() : int
+    protected function getStatus() : int
     {
         return $this->status;
     }
 }

52) /app/src/Worker/Worker.php:55    [M] Throw_

--- Original
+++ New
@@ @@
         $name = $message->getPayloadName();
         $handler = $this->getHandler($name);
         if ($handler === null) {
-            throw new RuntimeException("No handler for message {$name}");
+            new RuntimeException("No handler for message {$name}");
         }
         try {
             $event = new BeforeExecution($queue, $message);
